; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_11 ?v4 ?v5)
             (pred_5 ?v1 ?v12)
             (pred_9 ?v4 ?v12)
             (pred_8 ?v8 ?v4 )
	     (pred_7 ?v4)
             (pred_3 ?v11)
             (pred_1 ?v1)
             (pred_4 ?v12)
             (pred_6 ?v4)
             (pred_2 ?v1)
             (pred_12 ?v4)
             (pred_10 ))



(:action op_1
:parameters (?v9 ?v10 ?v13 ?v3)
:precondition (and (pred_3 ?v9) (pred_3 ?v10) (pred_1 ?v13) (pred_4 ?v3)
          (pred_11 ?v9 ?v10) (pred_5 ?v13 ?v3)
                   (pred_9 ?v10 ?v3) (pred_7 ?v9) 
                   (pred_6 ?v10) (pred_2 ?v13))
:effect (and  (pred_12 ?v10) (not (pred_6 ?v10))))


(:action op_5
:parameters (?v9 ?v7)
:precondition (and (pred_3 ?v9) (pred_3 ?v7)
               (pred_7 ?v9) (pred_11 ?v9 ?v7) (pred_12 ?v7))
:effect (and (pred_7 ?v7) (not (pred_7 ?v9))))

(:action op_3
:parameters (?v9 ?v13)
:precondition (and (pred_3 ?v9) (pred_1 ?v13) 
                  (pred_7 ?v9) (pred_8 ?v13 ?v9) (pred_10 ))
:effect (and (pred_2 ?v13)
   (not (pred_8 ?v13 ?v9)) (not (pred_10 ))))


(:action op_2
:parameters (?v9 ?v2 ?v6)
:precondition (and (pred_3 ?v9) (pred_1 ?v2) (pred_1 ?v6)
                  (pred_7 ?v9) (pred_2 ?v6) (pred_8 ?v2 ?v9))
:effect (and (pred_2 ?v2) (pred_8 ?v6 ?v9)
        (not (pred_2 ?v6)) (not (pred_8 ?v2 ?v9))))

(:action op_4
:parameters (?v9 ?v13)
:precondition (and (pred_3 ?v9) (pred_1 ?v13) 
                  (pred_7 ?v9) (pred_2 ?v13))
:effect (and (pred_10 ) (pred_8 ?v13 ?v9) (not (pred_2 ?v13)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_06 obj_16 obj_20 obj_07 obj_08 obj_17 obj_04 obj_13 obj_19 obj_09 obj_14 obj_10 obj_01 obj_11 obj_03 obj_18
    obj_12 obj_05
    obj_02 obj_15
    )

    (:init
       (pred_10)

       (pred_3 obj_06)
       (pred_3 obj_16)
       (pred_3 obj_20)
       (pred_3 obj_07)
       (pred_3 obj_08)
       (pred_3 obj_17)
       (pred_3 obj_04)
       (pred_3 obj_13)
       (pred_3 obj_19)
       (pred_3 obj_09)
       (pred_3 obj_14)
       (pred_3 obj_10)
       (pred_3 obj_01)
       (pred_3 obj_11)
       (pred_3 obj_03)
       (pred_3 obj_18)
       (pred_4 obj_12)
       (pred_4 obj_05)
       (pred_1 obj_02)
       (pred_1 obj_15)

       (pred_11 obj_06 obj_08)
       (pred_11 obj_06 obj_16)
       (pred_11 obj_16 obj_17)
       (pred_11 obj_16 obj_20)
       (pred_11 obj_16 obj_06)
       (pred_11 obj_20 obj_04)
       (pred_11 obj_20 obj_07)
       (pred_11 obj_20 obj_16)
       (pred_11 obj_07 obj_13)
       (pred_11 obj_07 obj_20)
       (pred_11 obj_08 obj_19)
       (pred_11 obj_08 obj_17)
       (pred_11 obj_08 obj_06)
       (pred_11 obj_17 obj_09)
       (pred_11 obj_17 obj_04)
       (pred_11 obj_17 obj_16)
       (pred_11 obj_17 obj_08)
       (pred_11 obj_04 obj_14)
       (pred_11 obj_04 obj_13)
       (pred_11 obj_04 obj_20)
       (pred_11 obj_04 obj_17)
       (pred_11 obj_13 obj_10)
       (pred_11 obj_13 obj_07)
       (pred_11 obj_13 obj_04)
       (pred_11 obj_19 obj_01)
       (pred_11 obj_19 obj_09)
       (pred_11 obj_19 obj_08)
       (pred_11 obj_09 obj_11)
       (pred_11 obj_09 obj_14)
       (pred_11 obj_09 obj_17)
       (pred_11 obj_09 obj_19)
       (pred_11 obj_14 obj_03)
       (pred_11 obj_14 obj_10)
       (pred_11 obj_14 obj_04)
       (pred_11 obj_14 obj_09)
       (pred_11 obj_10 obj_18)
       (pred_11 obj_10 obj_13)
       (pred_11 obj_10 obj_14)
       (pred_11 obj_01 obj_11)
       (pred_11 obj_01 obj_19)
       (pred_11 obj_11 obj_03)
       (pred_11 obj_11 obj_09)
       (pred_11 obj_11 obj_01)
       (pred_11 obj_03 obj_18)
       (pred_11 obj_03 obj_14)
       (pred_11 obj_03 obj_11)
       (pred_11 obj_18 obj_10)
       (pred_11 obj_18 obj_03)
       (pred_6 obj_20)
       (pred_6 obj_18)
       (pred_9  obj_20 obj_12)
       (pred_9  obj_18 obj_05)
       (pred_12 obj_06)
       (pred_12 obj_16)
       (pred_12 obj_07)
       (pred_12 obj_08)
       (pred_12 obj_17)
       (pred_12 obj_04)
       (pred_12 obj_13)
       (pred_12 obj_19)
       (pred_12 obj_09)
       (pred_12 obj_14)
       (pred_12 obj_10)
       (pred_12 obj_01)
       (pred_12 obj_11)
       (pred_12 obj_03)

       (pred_5  obj_02 obj_12)
       (pred_5  obj_15 obj_05)
       (pred_8 obj_02 obj_14)
       (pred_8 obj_15 obj_04)
       (pred_7 obj_06)
    )

    (:goal (and
       (pred_8 obj_15 obj_08)
    ))
(:constraints
  (always (not (pred_7 obj_17)))
)
)

; plan
1. (op_5 obj_06 obj_08)
   deleted: (pred_7 obj_06)
   added: (pred_7 obj_08)
   goals met: 0 of 1
2. (op_5 obj_08 obj_19)
   deleted: (pred_7 obj_08)
   added: (pred_7 obj_19)
   goals met: 0 of 1
3. (op_5 obj_19 obj_09)
   deleted: (pred_7 obj_19)
   added: (pred_7 obj_09)
   goals met: 0 of 1
4. (op_5 obj_09 obj_14)
   deleted: (pred_7 obj_09)
   added: (pred_7 obj_14)
   goals met: 0 of 1
5. (op_5 obj_14 obj_04)
   deleted: (pred_7 obj_14)
   added: (pred_7 obj_04)
   goals met: 0 of 1
6. (op_3 obj_04 obj_15)
   deleted: (pred_8 obj_15 obj_04) (pred_10)
   added: (pred_2 obj_15)
   goals met: 0 of 1
7. (op_5 obj_04 obj_14)
   deleted: (pred_7 obj_04)
   added: (pred_7 obj_14)
   goals met: 0 of 1
8. (op_5 obj_14 obj_09)
   deleted: (pred_7 obj_14)
   added: (pred_7 obj_09)
   goals met: 0 of 1
9. (op_5 obj_09 obj_19)
   deleted: (pred_7 obj_09)
   added: (pred_7 obj_19)
   goals met: 0 of 1
10. (op_5 obj_19 obj_08)
   deleted: (pred_7 obj_19)
   added: (pred_7 obj_08)
   goals met: 0 of 1
11. (op_4 obj_08 obj_15)
   deleted: (pred_2 obj_15)
   added: (pred_10) (pred_8 obj_15 obj_08)
   goals met: 1 of 1
